afipClient/facturaCorrecta.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ar="http://ar.gov.afip.dif.FEV1/">
    <soapenv:Header />
    <soapenv:Body>
        <ar:FECAESolicitar>
            <!-- Optional: -->
            <ar:Auth>
                <ar:Token>PD94…..</ar:Token>
                <ar:Sign>tYft0….....</ar:Sign>
                <ar:Cuit>33693450239</ar:Cuit>
            </ar:Auth>
            <ar:FeCAEReq>
                <ar:FeCabReq>
                    <ar:CantReg>1</ar:CantReg>
                    <ar:PtoVta>12</ar:PtoVta>
                    <ar:CbteTipo>1</ar:CbteTipo>
                         FACTURA A
                    </ar:FeCabReq>
                    <ar:FeDetReq>
                        <ar:FECAEDetRequest>
                            <ar:Concepto>1</ar:Concepto>
                                 Productos
                            <ar:DocTipo>80</ar:DocTipo>
                                 CUIT
                            <ar:DocNro>20111111112</ar:DocNro>
                            <ar:CbteDesde>1</ar:CbteDesde>
                            <ar:CbteHasta>1</ar:CbteHasta>
                            <ar:CbteFch>20100903</ar:CbteFch>
                            <ar:ImpTotal>184.05</ar:ImpTotal>
                            <ar:ImpTotConc>0</ar:ImpTotConc>
                            <ar:ImpNeto>150</ar:ImpNeto>
                            <ar:ImpOpEx>0</ar:ImpOpEx>
                            <ar:ImpTrib>7.8</ar:ImpTrib>
                            <ar:ImpIVA>26.25</ar:ImpIVA>
                            <ar:FchServDesde />
                            <ar:FchServHasta />
                            <ar:FchVtoPago />
                            <ar:MonId>PES</ar:MonId>
                            <ar:MonCotiz>1</ar:MonCotiz>
                            <ar:Tributos>
                                <ar:Tributo>
                                    <ar:Id>99</ar:Id>
                                    <ar:Desc>Impuesto Municipal Matanza</ar:Desc>
                                    <ar:BaseImp>150</ar:BaseImp>
                                    <ar:Alic>5.2</ar:Alic>
                                    <ar:Importe>7.8</ar:Importe>
                                </ar:Tributo>
                            </ar:Tributos>
                            <ar:Iva>
                                <ar:AlicIva>
                                    <ar:Id>5</ar:Id>
                                         21%
                                    <ar:BaseImp>100</ar:BaseImp>
                                    <ar:Importe>21</ar:Importe>
                                </ar:AlicIva>
                                <ar:AlicIva>
                                    <ar:Id>4</ar:Id>
                                         10.5%
                                    <ar:BaseImp>50</ar:BaseImp>
                                    <ar:Importe>5.25</ar:Importe>
                                </ar:AlicIva>
                            </ar:Iva>
                        </ar:FECAEDetRequest>
                    </ar:FeDetReq>
                </ar:FeCAEReq>
            </ar:FECAESolicitar>
        </soapenv:Body>
    </soapenv:Envelope>